Revit 2026 API

# ExternalResourceSubFolderFolderName Property

---

Folder displayed name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FolderName { get; set; }
```
```vb
Public Property FolderName As String
	Get
	Set
```
```cpp
public:
property String^ FolderName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FolderName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExternalResourceSubFolder Class

Autodesk.Revit.DB Namespace